{
  "id": "golf-day-2025-banner",
  "title": "Anne Davies Golf Day 2025 Banner",
  "category": "Print Design",
  "briefDescription": "Elegant roll-up banner design maintaining prestigious golf tournament tradition while delivering fresh visual impact.",
  "description": "Annual golf tournaments need fresh energy while honoring tradition. The Anne Davies Golf Day required a banner that would enhance the prestigious dinner atmosphere and serve as a focal point that guests would actually notice and remember.",
  "createdDate": "2025-08-15",
  "featured": true,
  "draft": false,
  "priority": 5,
  "image": "/images/portfolio/golf-day-2025-banner.jpg",
  "tags": ["Event Branding", "Golf Tournament", "Roll-up Banner", "Print Design"],
  "client": "Event Organizers",
  "year": "2025",
  "duration": "1 week",
  "industry": "Entertainment",
  "location": "UK",
  "projectType": "Marketing Campaign",
  "challenge": "Annual events face a tricky balance: honor tradition while staying fresh. The Anne Davies Golf Day needed a banner that maintained the prestigious feel attendees expect while providing visual impact that justified its place in the dinner venue. Last year's design needed evolution, not revolution, but had to command attention in a crowded event space.",
  "solution": "We refreshed the design with elegant typography and sophisticated colors appropriate for the golf day dinner setting. Prominently featured 'Anne Davies Golf Day 2025' with classic golf-inspired elements that felt both traditional and contemporary. The banner maintains visual continuity with past years while delivering the fresh presence this annual event deserved.",
  "results": [
    "Elegant banner enhancing dinner event atmosphere and guest experience",
    "Successful design refresh maintaining event prestige and tradition",
    "Professional focal point commanding attention in dinner venue",
    "Visual improvement over previous year while honoring established brand",
    "Enhanced event identity supporting long-term golf tournament reputation",
    "High-quality production suitable for prestigious golf event standards"
  ],
  "services": [
    "Annual Event Brand Evolution",
    "Large Format Print Design",
    "Golf Tournament Branding",
    "Event Atmosphere Enhancement"
  ],
  "brandMessage": "Annual events need design that honors tradition while delivering fresh impact. We create continuity that feels both familiar and exciting.",
  "whatWeLearned": "The best event design evolution maintains what works while improving what matters—atmosphere, recognition, and guest experience. Tradition and innovation can coexist.",
  "liveUrl": "https://trello.com/c/ZUEcET7d/235-235golf-day-2025-banner", 
  "images": [
    "/images/portfolio/golf-day-2025-banner/banner-design-elegant.jpg",
    "/images/portfolio/golf-day-2025-banner/dinner-venue-setup.jpg",
    "/images/portfolio/golf-day-2025-banner/previous-year-comparison.jpg",
    "/images/portfolio/golf-day-2025-banner/print-production-quality.jpg"
  ]
}