{
  "id": "interiorem-solutions-advertisement",
  "title": "Interiorem Solutions Trade Advertisement",
  "category": "Marketing Campaign",
  "briefDescription": "Urgent full-page trade advertisement positioning 90-year heritage interior design firm as 'Custodians of Your Vision'.",
  "description": "When you have one day to create a full-page ad for a critical networking event, every element has to work. Interiorem Solutions needed an advertisement that would position them as 'Custodians of Your Vision' while showcasing 90 years of interior design expertise.",
  "createdDate": "2025-09-09",
  "featured": true,
  "draft": false,
  "priority": 7,
  "image": "/images/portfolio/interiorem-solutions-advertisement.jpg",
  "tags": ["Trade Advertising", "Interior Design", "Heritage Branding", "B2B Marketing"],
  "client": "Interiorem Solutions", 
  "year": "2025",
  "duration": "1 day",
  "industry": "Professional Services",
  "location": "UK",
  "projectType": "Marketing Campaign",
  "challenge": "Urgent deadline, critical event. Interiorem Solutions needed a full-page A4 advertisement for a buyers event where Jamie would represent the company. One day to create compelling positioning around their 'Custodians of Your Vision' concept while communicating 90 years of heritage and collaborative expertise. No time for revision cycles or extensive client feedback loops.",
  "solution": "We focused on what mattered: distinctive branding, clear positioning, and compelling messaging. Incorporated their logo, signature pattern, and 'Custodians of Your Vision' tagline with Jamie's authentic brand story about transparency, partnership, and heritage knowledge. Created two color variations—blue and cream—ensuring optimal impact regardless of event materials context.",
  "results": [
    "Same-day delivery meeting critical buyers event deadline",
    "Compelling 'Custodians of Your Vision' positioning differentiating from competitors",
    "Strategic integration of 90-year heritage messaging building credibility",
    "Professional brand representation supporting Jamie's networking efforts",
    "Enhanced industry visibility at important commercial interior design event", 
    "Flexible color options maximizing advertisement effectiveness"
  ],
  "services": [
    "Urgent Trade Advertisement Design",
    "Brand Positioning Strategy",
    "Heritage Brand Integration",
    "Event Marketing Support"
  ],
  "brandMessage": "Great positioning works under pressure. When you have one day and one shot, clarity and authenticity matter more than perfection.",
  "whatWeLearned": "Urgent deadlines force focus on what actually matters—clear positioning, authentic messaging, and professional execution. Sometimes constraints create better work.",
  "liveUrl": "https://trello.com/c/ZZLmG9G6/264-264-full-page-advert-for-is",
  "images": [
    "/images/portfolio/interiorem-solutions-advertisement/full-page-advert-blue.jpg",
    "/images/portfolio/interiorem-solutions-advertisement/full-page-advert-cream.jpg",
    "/images/portfolio/interiorem-solutions-advertisement/heritage-messaging-integration.jpg",
    "/images/portfolio/interiorem-solutions-advertisement/buyers-event-context.jpg"
  ]
}