{
  "id": "measom-linkedin-headers",
  "title": "MEASOM LinkedIn Profile Standardization",
  "category": "Social Media",
  "briefDescription": "LinkedIn header standardization encouraging team networking while showcasing 90-year construction heritage.",
  "description": "MEASOM wanted their team on LinkedIn, but individual profiles looked scattered and unprofessional. We created headers that encourage networking while showcasing their 90-year construction heritage—turning individual profiles into brand ambassadors.",
  "createdDate": "2025-08-19",
  "featured": true,
  "draft": false,
  "priority": 4,
  "image": "/images/portfolio/measom-linkedin-headers.jpg",
  "tags": ["LinkedIn Branding", "Professional Development", "Corporate Identity", "Team Branding"],
  "client": "MEASOM",
  "year": "2025",
  "duration": "2 weeks", 
  "industry": "Construction",
  "location": "UK",
  "projectType": "Digital Transformation",
  "challenge": "LinkedIn works when your team uses it. MEASOM's challenge wasn't just getting their people online—it was making sure they looked professional and cohesive when they got there. With fresh headshots done but inconsistent profiles, they needed headers that would encourage networking while building brand recognition across their 90-year heritage business.",
  "solution": "We designed LinkedIn headers that work with their new professional photos, not against them. Incorporated MEASOM branding alongside their impressive 90-year heritage. Multiple concept variations that maintain individual professional identity while creating unmistakable brand consistency. Headers optimized for LinkedIn's specs and designed to make networking feel natural.",
  "results": [
    "Cohesive professional LinkedIn presence across entire MEASOM team",
    "Increased team confidence and engagement with LinkedIn networking", 
    "Enhanced company visibility driving business development opportunities",
    "Strategic integration of 90-year heritage messaging",
    "Professional appearance complementing new headshot investment",
    "Standardized approach that works as team grows"
  ],
  "services": [
    "LinkedIn Profile Optimization",
    "Corporate Team Branding",
    "Professional Development Support",
    "Heritage Brand Integration"
  ],
  "brandMessage": "Individual LinkedIn profiles become powerful when they work together. We created consistency that encourages networking instead of hindering it.",
  "whatWeLearned": "Professional development and brand consistency aren't competing goals—when done right, they reinforce each other to create stronger business relationships.",
  "liveUrl": "https://trello.com/c/luFjM1Zm/111-174measom-linkedin-header",
  "images": [
    "/images/portfolio/measom-linkedin-headers/linkedin-header-concepts.jpg",
    "/images/portfolio/measom-linkedin-headers/90-year-anniversary-integration.jpg",
    "/images/portfolio/measom-linkedin-headers/team-headshot-coordination.jpg",
    "/images/portfolio/measom-linkedin-headers/linkedin-profile-transformation.jpg"
  ]
}